Repository: Ukrainian-Irdya-Project/wesnoth-uk
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: uk_ua

source: error
uk_ua: помилка

source: evil eye
uk_ua: лихе око

source: expected at $pos
uk_ua: очіковано у $pos

source: expert
uk_ua: експерт

source: faerie fire
uk_ua: чарівний вогонь

source: faerie touch
uk_ua: дотик феї

source: falcon
uk_ua: сокіл

source: fall
uk_ua: схил

source: fangs
uk_ua: ікла

source: fearless
uk_ua: безстрашний

source: fearless, undead, healthy, tenacity
uk_ua: безстрашний, мрець, живучий, чіпкість

source: feature^Cocoa notifications back end
uk_ua: Cocoa сповіщення

source: feature^D-Bus notifications back end
uk_ua: D-Bus сповіщення

source: feature^Lua console completion
uk_ua: доповнення вводу в консолі Lua

source: feature^Win32 notifications back end
uk_ua: Win32 сповіщення

source: feeding
uk_ua: пожирач

source: feeding, +3 HP
uk_ua: пожирач, +3 ЗД

source: female^A quintain? You want me to fight a dummy?
uk_ua: Опудало? Ви пропонуєте мені битися з манекеном?

source: female^Advancing a level has fully healed me! I am good with both bow and sword, and I have a special ability: <i>Ambush</i>. I can hide in forests where enemies can only see me if they are right next to me.
uk_ua: Я перейшла на новий рівень і повністю вилікувалася! Я добре володію як мечем, так і луком, до того ж у мене є особлива здатність: <i>засідка</i>. Я можу сховатися в лісі, і ворог побачить мене лише якщо опиниться прямо поруч зі мною.

source: female^Advancing a level has fully healed me! I have become better at using the sword, dealing 9 damage in 4 attacks. Although I do not have any special abilities, my fighting skills will allow me to beat the orcs by dealing more damage!
uk_ua: Я перейшла на новий рівень і повністю вилікувалася! Я тепер дуже добре володію мечем і завдаю 9 одиниць шкоди в кожній з 4 атак. Хоча у мене нема особливих здібностей, але завдяки фантастичному володінню зброєю я завдаю більше шкоди!

source: female^Advancing a level has fully healed me! When attacking, I always have at least a 60% chance of hitting with my longbow thanks to my <i>Marksman</i> ability, and I deal 9 damage each for 4 attacks. Use me to dislodge hard-to-hit units.
uk_ua: Я перейшла на новий рівень і повністю вилікувалась! Тепер у мене є здатність <i>снайпер</i> — я влучаю з лука з імовірністю 60% і завдаю 9 одиниць шкоди кожною з 4 атак. З моєю допомогою ви можете дістати найбільш важкодоступних ворогів.

source: female^Agh! This training is too much for me...
uk_ua: Агр! Це тренування занадто складне для мене...

source: female^Alright. The bridge it is, then, but I’ll be careful about the crossing.
uk_ua: Добре. Тепер міст, але я буду обережною при переправі.

source: female^Arch Mage
uk_ua: Архимага

source: female^Armageddon Drake
uk_ua: Дрейкиня Армагедону

source: female^Assassin
uk_ua: Вбивця

source: female^Black Nightmare
uk_ua: Чорна кобила

source: female^Borderer
uk_ua: Прикордонниця

source: female^Can’t we just move around the orcs?
uk_ua: А ми можемо просто обійти цих орків?

source: female^Criminal
uk_ua: Злочиниця

source: female^Dark Adept
uk_ua: Темна адептка

source: female^Dark Horse
uk_ua: Темна кобила

source: female^Drake Arbiter
uk_ua: Дрейкиня суддя

source: female^Drake Blademaster
uk_ua: Дрейкиня майстер клинка

source: female^Drake Burner
uk_ua: Дрейкиня палій

source: female^Drake Clasher
uk_ua: Дрейкиня боєць

source: female^Drake Enforcer
uk_ua: Дрейкиня броненосець

source: female^Drake Fighter
uk_ua: Дрейкиня воїн

source: female^Drake Flameheart
uk_ua: Полум'яне Серце

source: female^Drake Flare
uk_ua: Дрейкиня Світоч

source: female^Drake Glider
uk_ua: Планерка

source: female^Drake Thrasher
uk_ua: Дрейкиня молотар

source: female^Drake Warden
uk_ua: Дрейкиня наглядач

source: female^Drake Warrior
uk_ua: Дрейкиня вояка

source: female^Dune Burner
uk_ua: Палійка дюн

source: female^Dune Falconer
uk_ua: Сокольниця дюн

source: female^Dune Firetrooper
uk_ua: Вогнеметчиця дюн

source: female^Dune Harrier
uk_ua: Нишпорка дюн

source: female^Dune Scorcher
uk_ua: Палійка дюн

source: female^Dune Skirmisher
uk_ua: Авангардистка дюн

source: female^Dune Sky Hunter
uk_ua: Небесна мисливиця дюн

source: female^Dune Strider
uk_ua: Блукачка дюн

source: female^Elvish Archer
uk_ua: Ельфа лучниця

source: female^Elvish Avenger
uk_ua: Ельфа месниця

source: female^Elvish Bodyguard
uk_ua: Ельфійка Тілохранителька

source: female^Elvish Druid
uk_ua: Ельфа друїда

source: female^Elvish Enchantress
uk_ua: Ельфа чарівниця

source: female^Elvish Lady
uk_ua: Ельфійська леді

source: female^Elvish Marksman
uk_ua: Ельфа стрілець

source: female^Elvish Ranger
uk_ua: Ельфа ліснича

source: female^Elvish Shaman
uk_ua: Ельфа шаманка

source: female^Elvish Sharpshooter
uk_ua: Ельфа снайпер

source: female^Elvish Shyde
uk_ua: Ельфа шида

source: female^Elvish Sorceress
uk_ua: Ельфа чаклунка

source: female^Elvish Sylph
uk_ua: Ельфа сильфа

source: female^Fighter
uk_ua: Воїн

source: female^Fire Drake
uk_ua: Вогняна дрейкиня

source: female^Footpad
uk_ua: Розбишака

source: female^Frontier Baroness
uk_ua: Прикордонна баронеса

source: female^Fugitive
uk_ua: Втікачка

source: female^Galdrad, if I go by the ford, I could sneak up near his keep and dispatch him quickly.
uk_ua: Гальдрад, якщо я піду через брід, я можу підкрастися до його табору та швидко його вбити.

source: female^Good morning, Delfador! Is it time to attack things?
uk_ua: Доброго ранку, Делфадоре! Чи не час нам на когось напасти?

source: female^Great Mage
uk_ua: Велика мага

source: female^Hang on! You need to gather your forces. Or do you intend to fight the orcs single-handedly?
uk_ua: Почекай! Тобі потрібно зібрати своє військо. Чи ти зібралася битися з орками?

source: female^Have you found an orc for me to fight, huh? A troll?
uk_ua: Ви знайшли мені орка, га? Може троля?

source: female^Hey, the quintain just healed 2 hitpoints! I’d better attack it at once!
uk_ua: Гей, це опудало щойно відновило 2 очки здоров'я! Краще напасти на нього знову!

source: female^Ho, Galdrad! Has Delfador conjured something else to beat me with? A flock of scarecrows, perhaps?
uk_ua: Хо-хо, Гальдрад! Делфадор начаклував мені ще супротивників? Мабуть, купку городніх опудал?

source: female^Hurricane Drake
uk_ua: Буревійка

source: female^I could make use of some healing in a village.
uk_ua: Ой! Я б підлікувалася у селі.

source: female^I had better retreat, before I get caught out with such low health!
uk_ua: Мені краще втекти, щоб не потрапити в халепу з таким низьким здоров’ям!

source: female^I have enough gold to recruit more units!
uk_ua: У мене достатньо грошей щоб завербувати більше бійців!

source: female^I hope I have a chance to retreat after this!
uk_ua: Сподіваюся, після цього я зможу відступити!

source: female^I think I’ll stick around the keep for now, in order to recruit more units.
uk_ua: Я думаю мені зараз треба були недалеко від замку, щоб можна було найняти ще бійців.

source: female^Inferno Drake
uk_ua: Пекельна дрейкиня

source: female^I’ll recruit some elves!
uk_ua: Я завербую декількох ельфів!

source: female^I’ll tell them to use the one that does more damage!
uk_ua: Я звелю їм використати ту, котра наносить більше шкоди!

source: female^Let’s go! Attack!
uk_ua: Вперед! В атаку!

source: female^Mage
uk_ua: Мага

source: female^Mage of Light
uk_ua: Світла мага

source: female^Mal Maul
uk_ua: Мал Маула

source: female^Mermaid Diviner
uk_ua: Віщунка

source: female^Mermaid Enchantress
uk_ua: Чаклунка

source: female^Mermaid Initiate
uk_ua: Посвячена русалка

source: female^Mermaid Priestess
uk_ua: Жриця

source: female^Necromancer
uk_ua: Некромантка

source: female^One fewer orc to deal with, and our way across the bridge is clear! I also gained experience from striking the killing blow!
uk_ua: Треба забрати ще одного орка і шлях через міст вільний! Я також отримала досвід від добивання ворога!

source: female^One lucky attack by an Orcish Grunt, and I’m done for!
uk_ua: Одна вдачна атака орка-піхотинця — і мені гаплик!

source: female^Ouch! I need to heal! Only $student_hp hitpoints left!
uk_ua: Ой! Мені треба підлікуватись! В мене залишилось лише $student_hp очок здоров'я!

source: female^Outlaw
uk_ua: Вигнанка

source: female^Peasant Youth
uk_ua: Молода селянка

source: female^Princess
uk_ua: Принцеса

source: female^Red Mage
uk_ua: Червона мага

source: female^Rogue
uk_ua: Шахрайка

source: female^Saurian Ambusher
uk_ua: Партизанка

source: female^Saurian Flanker
uk_ua: Флангова

source: female^Saurian Javelineer
uk_ua: Ящірка списоносець

source: female^Saurian Skirmisher
uk_ua: Авангардистка

source: female^Saurian Spearthrower
uk_ua: Кидачка списів

source: female^Senior Village Elder
uk_ua: Старійшина села

source: female^Should I retreat?
uk_ua: Може, відступити?

source: female^Silver Mage
uk_ua: Срібна мага

source: female^Sky Drake
uk_ua: Небесна дрейкиня

source: female^That... was foolish. Next time I should be more careful.
uk_ua: Це... було по-дурному. Я буду обережнішою наступного разу.

source: female^Thief
uk_ua: Злодійка

source: female^Vampire Lady
uk_ua: Пані вампірів

source: female^Warrior
uk_ua: Воїтелька

source: female^Watchwoman
uk_ua: Дозорна

source: female^Well, I think I know the basics. Onwards! Maybe I can fight in a real battle next?
uk_ua: Добре, мені здається я знаю основи. Вперед! Можливо, наступна битва буде справжньою?

source: female^Wesfolk Lady
uk_ua: Пані весфольків

source: female^Wesfolk Leader
uk_ua: Лідерка весфольків

source: female^Wesfolk Outcast
uk_ua: Вигнанка весфольків

source: female^What should I do?
uk_ua: Що мені робити?

source: female^White Mage
uk_ua: Біла мага

source: female^Young lady, you have $student_hp hitpoints and a sword. I’m fairly sure you’ll win.
uk_ua: Панночко, у вас $student_hp одиниці здоров'я та ще й меч на додачу. Я впевнений, що ви переможете.

source: female^aged
uk_ua: стара

source: female^ambush
uk_ua: засідка

source: female^burrow
uk_ua: зарита

source: female^chaotic
uk_ua: хаотична

source: female^concealment
uk_ua: переховування

source: female^cured
uk_ua: вилікувана

source: female^cures
uk_ua: лікує

source: female^dextrous
uk_ua: влучна

source: female^dim
uk_ua: дурна

source: female^diversion
uk_ua: диверсія

source: female^elemental
uk_ua: стихійна

source: female^epic
uk_ua: епічна

source: female^expert
uk_ua: експертка

source: female^fearless
uk_ua: безстрашна

source: female^feeding
uk_ua: пожирачка

source: female^feral
uk_ua: дика

source: female^heals +12
uk_ua: зцілює +12

source: female^heals +4
uk_ua: зцілює +4

source: female^heals +8
uk_ua: зцілює +8

source: female^healthy
uk_ua: живуча

source: female^heroic
uk_ua: героїчна

source: female^illuminates
uk_ua: освітлює

source: female^inspire
uk_ua: надихає

source: female^intelligent
uk_ua: розумна

source: female^lawful
uk_ua: порядна

source: female^leadership
uk_ua: лідерство

source: female^legendary
uk_ua: легендарна

source: female^liminal
uk_ua: тіньова

source: female^loyal
uk_ua: вірна

source: female^mechanical
uk_ua: механізм

source: female^neutral
uk_ua: нейтральна

source: female^petrified
uk_ua: паралізована

source: female^poisoned
uk_ua: отруєна

source: female^quick
uk_ua: швидка

source: female^regenerates
uk_ua: регенерує

source: female^regenerates +4
uk_ua: регенерує +4

source: female^resilient
uk_ua: витривала

source: female^skirmisher
uk_ua: авангардистка

source: female^slow
uk_ua: повільна

source: female^slowed
uk_ua: уповільнена

source: female^steadfast
uk_ua: стійка

source: female^strong
uk_ua: сильна

source: female^stunned
uk_ua: оглушена

source: female^submerge
uk_ua: занурюється

source: female^swamp lurk
uk_ua: болотяне скрадання

source: female^teleport
uk_ua: телепорт

source: female^trained
uk_ua: тренована

source: female^undead
uk_ua: мертва

source: female^unhealable
uk_ua: невиліковна

source: female^weak
uk_ua: слабка

source: feral
uk_ua: дикий

source: fighter
uk_ua: воїн

source: fighting bonus
uk_ua: бонус бою

source: filesystem^Browse
uk_ua: Оглянути

source: filesystem^Copy
uk_ua: Копіювати

source: filesystem^Open
uk_ua: Відкрити

source: filesystem_path_game^Editor maps
uk_ua: Карти редактора

source: filesystem_path_game^Game data
uk_ua: Дані гри

source: filesystem_path_game^Game executables
uk_ua: Виконуваний файл

source: filesystem_path_game^User data
uk_ua: Дані користувача

source: filesystem_path_system^Home
uk_ua: Домашня тека

source: filesystem_path_system^Root
uk_ua: Корінь

source: filesystem_path_system^Volumes
uk_ua: Томи

source: fire
uk_ua: вогонь

source: fire breath
uk_ua: вогняний подих

source: fire claws
uk_ua: вогняні кігті

source: fireball
uk_ua: вогняна куля

source: first strike
uk_ua: перший удар

source: firststrike
uk_ua: перший напад

source: fist
uk_ua: кулак

source: flail
uk_ua: ціп

source: flame blast
uk_ua: полум'яний удар

source: flamethrower
uk_ua: вогнемет

source: flaming sword
uk_ua: палаючий меч

source: flat
uk_ua: рівнина

source: focusing on defeating $ai_controller.side_$ally_side|_current_settings.focus_on_enemy.side_description|.
uk_ua: зосередитись на атаці $ai_controller.side_$ally_side|_current_settings.focus_on_enemy.side_description|.

source: focusing on defending the area around $x1|,$y1|.
uk_ua: зосередитись на обороні області навколо $x1|,$y1|.

source: focusing on protecting $ai_controller.side_$ally_side|_current_settings.protect.side_description|.
uk_ua: зосередитись на обороні $ai_controller.side_$ally_side|_current_settings.protect.side_description|.

source: for a moment.
uk_ua: ...на мить.

source: forcefield
uk_ua: силове поле

source: forceful scimitar strike
uk_ua: сильний удар скімітаром

source: forest
uk_ua: ліс

source: forest_type=Forest|Forest|Wood main=$base {forest_type}|$base{!}’s {forest_type}|{forest_type} $base
uk_ua: forest_type=Ліс|Ліс|Гай main=$base{!}ський {forest_type}|$base{!}ський {forest_type}|{forest_type} $base

source: free upkeep
uk_ua: нульове утримання

source: friend
uk_ua: друг

source: friends and ignores list
uk_ua: списки друзів і ігнору

source: friends list
uk_ua: перелік друзів

source: frozen
uk_ua: мерзлота

source: fury
uk_ua: лють

source: game^Play
uk_ua: Грати

source: game_hotkeys^G
uk_ua: Г

source: game_version^Current Version
uk_ua: Теперішня версія

source: game_version^Wesnoth $version
uk_ua: Веснот $version

source: gaze
uk_ua: погляд

source: gender^Female
uk_ua: Жінка

source: gender^Male
uk_ua: Чоловік

source: gender^Random
uk_ua: Випадкова

source: glaive
uk_ua: глевія

source: greatsword
uk_ua: великий меч

source: halberd
uk_ua: алебарда

source: hammer
uk_ua: молот

source: hatchet
uk_ua: топірець

source: healer
uk_ua: цілитель

source: heals +12
uk_ua: зцілює +12

source: heals +4
uk_ua: зцілює +4

source: heals +4, cures
uk_ua: лікує +4, зцілює

source: heals +8
uk_ua: зцілює +8

source: heals +8, cures
uk_ua: лікує +8, зцілює

source: healthy
uk_ua: живучий

source: help
uk_ua: довідка

source: heroic
uk_ua: героїчний

source: holy sword
uk_ua: святий меч

source: holy water^Leave it
uk_ua: Залишити

source: holy water^Take it
uk_ua: Взяти

source: hooves
uk_ua: копита

source: horn
uk_ua: ріг

source: ice blast
uk_ua: льодяний удар

source: ice bow
uk_ua: лук льоду

source: ice claw
uk_ua: льодяні кігті

source: ignored
uk_ua: ігнорується

source: ignores list
uk_ua: список ігнору

source: illuminates
uk_ua: освітлює

source: illuminates, lawful, heals +4, firststrike
uk_ua: освічує, вірність, лікує +4, перший удар

source: impact
uk_ua: ударний

source: impact: +1 strike and +2 damage
uk_ua: ударний: +1 атака та +2 шкоди

source: infix_binary^i
uk_ua: і

source: ink
uk_ua: туш

source: input
uk_ua: ввід

source: inspire
uk_ua: надихає

source: instead, use the macro with the same name in the [campaign] tag
uk_ua: замість цього, використовуйте macro з таким же іменем в тегу [campaign]

source: intelligent
uk_ua: розумний

source: invisible:
uk_ua: невидимий:

source: invulnerable:
uk_ua: невразливий:

source: island factor
uk_ua: коефіцієнт острову

source: iterations
uk_ua: повторення

source: jamming:
uk_ua: заглушення:

source: javelin
uk_ua: дротик

source: jaw
uk_ua: щелепи

source: keep size
uk_ua: розмір замку

source: kick
uk_ua: удар

source: kill bonus
uk_ua: бонус вбивства

source: lake_type=Lake|Lake|Lake|Loch|Sea main=$base {lake_type}|{lake_type} $base
uk_ua: lake_type=Озеро|Озеро|Озеро|Море main=$base{!}ське {lake_type}|{lake_type} $base

source: lance
uk_ua: спис

source: language code for localized resources^en_US
uk_ua: uk

source: lawful
uk_ua: порядний

source: lawful units do more damage at day and less damage at night
uk_ua: порядні бійці наносять більше шкоди вдень та менше вночі

source: leadership
uk_ua: лідерство

source: legendary
uk_ua: легендарний

source: level $level
uk_ua: $level рівень

source: library^Build version
uk_ua: Версія збірки

source: library^Name
uk_ua: Назва

source: library^Runtime version
uk_ua: Версія виконання

source: lightbeam
uk_ua: промінь світла

source: lightning
uk_ua: блискавка

source: liminal
uk_ua: тіньовий

source: lobby
uk_ua: фойє

source: log_level^Debug
uk_ua: Debug

source: log_level^Error
uk_ua: Помилка

source: log_level^Info
uk_ua: Інформація

source: log_level^None
uk_ua: Нічого

source: log_level^Warning
uk_ua: Попередження

source: longbow
uk_ua: довгий лук

source: longsword
uk_ua: довгий меч

source: loyal
uk_ua: вірний

source: lua console
uk_ua: консоль Lua

source: mace
uk_ua: булава

source: made of^Coral
uk_ua: Коралу

source: magic blast
uk_ua: магічний вибух

source: magical
uk_ua: магія

source: main=$base{!}’s Peak|$base Peak|Mount $base|Mount $base
uk_ua: main=$base{!}ський Пік|Пік $base|Гора $base|Гора $base

source: main={generated_prefix_c}{suffix_c}|{generated_prefix_v}{suffix_v}|{prefix_c}{centre_c}{suffix_c}|{prefix_v}{centre_v}{suffix_v} generated_prefix_c={starting_consonnant}{vowel}{consonnant}|{starting_vowel}{consonnant} generated_prefix_v={starting_consonnant}{vowel}|{starting_vowel} starting_consonnant=B|C|D|G|H|L|M|R|Rh|S|T|V starting_vowel=A|E|I|Y|Ae vowel=a|e|i|o|u|y|eo|ae consonnant=w|l|d|n|r|rc|ll|nn|dd|th prefix_c=Add|Den|Derr|Gum|Mad|Mar|Ow|Tedd|T{vowel}n|Var|Vin|Vob|Vug|Yr|Rhyr prefix_v=Ae|Bl{vowel}|C{vowel}|D{vowel}|Gl{vowel}|G{vowel}|Gw{vowel}|Ha|L{vowel}|M{vowel}|R{vowel}|Rh{vowel}|S{vowel}|S{vowel}|T{vowel}|V{vowel} suffix_c=yn|er|yc|ec|oc|yr|in|aent suffix_v=ry|ryn|ran|lyn|van|nyc centre_c=redd|reor|og|thyn centre_v=rae|ra|thar|gwy
uk_ua: main={generated_prefix_c}{suffix_c}|{generated_prefix_v}{suffix_v}|{prefix_c}{centre_c}{suffix_c}|{prefix_v}{centre_v}{suffix_v} generated_prefix_c={starting_consonnant}{vowel}{consonnant}|{starting_vowel}{consonnant} generated_prefix_v={starting_consonnant}{vowel}|{starting_vowel} starting_consonnant=Б|С|Д|Г|Х|Л|М|Р|Рх|С|Т|В starting_vowel=А|Е|І|У|Ае vowel=а|е|і|о|и|у|ео|ае consonnant=в|л|в|н|р|рс|лл|нн|дд|з prefix_c=Адд|Ден|Дерр|Гим|Мад|Мар|Ов|Тедд|Т{vowel}н|Вар|Він|Воб|Виг|Ур|Рур prefix_v=Ае|Вл{vowel}|С{vowel}|Д{vowel}|Гл{vowel}|Г{vowel}|Гв{vowel}|Ха|Л{vowel}|М{vowel}|Р{vowel}|Р{vowel}|С{vowel}|С{vowel}|Т{vowel}|В{vowel} suffix_c=ин|ер|ис|ес|ос|ир|ін|аент suffix_v=ри|рин|ран|лин|ван|нис centre_c=редд|реор|ог|зин centre_v=рае|ра|зар|гви

source: main={generated_prefix_c}{suffix_c}|{generated_prefix_v}{suffix_v}|{prefix_c}{centre_c}{suffix_c}|{prefix_v}{centre_v}{suffix_v} generated_prefix_c={starting_consonnant}{vowel}{consonnant}|{starting_vowel}{consonnant} generated_prefix_v={starting_consonnant}{vowel}|{starting_vowel} starting_consonnant=B|C|D|G|H|L|M|R|Rh|S|T|V starting_vowel=A|E|I|Y|Ae vowel=a|e|i|o|u|y|eo|ae consonnant=w|l|d|n|r|rc|ll|nn|dd|th prefix_c=Al|El|Mer|Mil|Rer|Ys|M{vowel}r|M{vowel}l prefix_v=A|Br{vowel}|Cl{vowel}|C{vowel}|D{vowel}|Gw{vowel}|He|J{vowel}|L{vowel}|M{vowel}|N{vowel}|R{vowel}|S{vowel} suffix_c=yan|oic|ell|yll suffix_v=wyn|nna|lla|ra|la|wyan|ssa|ka|ven centre_c=il|ing|ol|ur|ung|ean|eal|ong|al|iv centre_v=na|lla|na|ry|li|ni|ri|rae|bry
uk_ua: main={generated_prefix_c}{suffix_c}|{generated_prefix_v}{suffix_v}|{prefix_c}{centre_c}{suffix_c}|{prefix_v}{centre_v}{suffix_v} generated_prefix_c={starting_consonnant}{vowel}{consonnant}|{starting_vowel}{consonnant} generated_prefix_v={starting_consonnant}{vowel}|{starting_vowel} starting_consonnant=Б|С|Д|Г|Х|Л|М|Р|Рх|С|Т|В starting_vowel=А|Е|І|У|Ае vowel=а|е|і|о|у|и|ео|ае consonnant=в|л|д|т|р|рс|лл|нн|дд|з prefix_c=Ал|Ел|Мер|Міл|Рер|Ус|М{vowel}р|М{vowel}л prefix_v=А|Бр{vowel}|Сл{vowel}|К{vowel}|Д{vowel}|Гв{vowel}|Хе|Ю{vowel}|Л{vowel}|М{vowel}|Н{vowel}|Р{vowel}|С{vowel} suffix_c=иан|оік|елл|илл suffix_v=вин|нна|лла|ра|ла|виан|сса|ка|вен centre_c=іл|інг|ол|ур|унг|еан|еал|онг|ал|ів centre_v=на|лла|на|ри|лі|ні|рі|рае|бри

source: main={generated_prefix_v}{centre_v}{suffix_v}|{generated_prefix_c}{centre_c}{suffix_c} generated_prefix_v={starting_consonnant}{vowel} generated_prefix_c={starting_consonnant}{vowel}{consonnant} starting_consonnant=C|D|F|L|M|N|P|Qu|R|S|T|V vowel=a|e|i|o|ae|é|ë consonnant=n|l|r|m|s|v|th|p|d|f|t prefix_c=Val|Ol|Am|An|El|Fa|El|Glo|Hu|Le|Mil|Nil|Pin|Por|Mot|Mor|Thral|Leg|Nam|Nym|Sim|Len|Is|Thal prefix_v=La|Va|Tha|Ne|Ay|Ce|Fa|Phe|Ja|Que|Ma|Mi|Pa|Ri|Siu|Ga|Ca|De|Eä|Eo|No|Pó|Le|Ló|Isá|Pa|Sa|Ni|Ti|Uno|Uni|Vó|Gio suffix_v=thea|nia|lia|kea|ni|ith|niel|wiel|ra|dë|lya|thiel|nna|nne suffix_c=iel|ien|ya|a|ë|i|ia|ea centre_v=|{short_centre_v} short_centre_v=nna|lla|na|thi|saie|li|ma|lo|thra|ló|rá|bri|fi|mi|nio|wi|né|nu|wi centre_c=|{short_centre_c} short_centre_c=enn|all|an|ith|el|il|am|ol|arth|ól|ár|ir|if|im|ion|iw|én|un|iw
uk_ua: main={generated_prefix_v}{centre_v}{suffix_v}|{generated_prefix_c}{centre_c}{suffix_c} generated_prefix_v={starting_consonnant}{vowel} generated_prefix_c={starting_consonnant}{vowel}{consonnant} starting_consonnant=С|Д|Ф|Л|М|Н|Р|Кв|Р|С|Т|В vowel=а|е|і|о|ає|é|є consonnant=н|л|р|м|с|в|з|п|д|ф|т prefix_c=Валь|Оль|Ам|Ан|Єль|Фа|Єль|Гло|Ху|Ле|Міл|Ніль|Пін|Пор|Мот|Мор|Зраль|Лег|Нам|Нум|Сім|Лен|Іс|Заль prefix_v=Ла|Ва|За|Не|Ау|Се|Фа|Фе|Я|Кве|Ма|Мі|Па|Рі|Сіу|Га|Ка|Де|Єä|Єо|Но|Пó|Ле|Лó|Ісá|Па|Са|Ні|Ті|Уно|Уні|Вó|Гіо suffix_v=зеа|ніа|ліа|кеа|ні|із|нієль|вієль|ра|дë|лиа|зієль|нна|нне suffix_c=ієль|ієн|я|а|е|і|иа|еа centre_v=|{short_centre_v} short_centre_v=нна|лла|на|за|саіє|лі|ма|ло|зра|лó|рá|брі|фі|мі|ніо|ві|нé|ну|ві centre_c=|{short_centre_c} short_centre_c=енн|алл|ан|із|ель|іл|ам|оль|арз|óл|áр|ір|іф|ім|іон|ів|éн|ун|ів

source: main={generated_prefix}{consonnant}{suffix}|{prefix}{centre}{suffix} generated_prefix={starting_consonnant}{vowel} starting_consonnant=C|D|F|L|M|N|P|Qu|R|S|T|V vowel=a|e|i|o|ae|é|ë consonnant=n|l|r|m|s|v|th|nn prefix={prefix_vc}{vowel}|{prefix_cv} prefix_vc=Lon|Eon|Ad|Sar|Al|Tal|Tin|El|Leg|Or|Tir|Ol|Cál|Cán|Elv|Fan|Fad|Fith|Fil|Gal|Glad|Leg|Glar|Gli|Hár|Tad|Sór|Pyr prefix_cv=Ama|Ami|Be|Ca|Ga|Isi|Ha|He|Le|Ló|Ny|Ni|Ma|Thu|Thri|Ti|Unu|Ve|Va suffix=or|im|ian|in|ar|iel|as|eon|as|or|ion|al|and|ér|as|ir|el|al|ad|ael centre={short_centre}|{short_centre}|-{short_centre}|{short_centre}- short_centre=lol|febr|tom|lith|nal|lor|wón|rad|rien|mar|reb|riel|mal|ram|nil|nim|nol|bris|lad|rier|ra|fil|thran|man
uk_ua: main={generated_prefix}{consonnant}{suffix}|{prefix}{centre}{suffix} generated_prefix={starting_consonnant}{vowel} starting_consonnant=С|Д|Ф|Л|М|Н|П|Кв|Р|С|Т|В vowel=а|е|і|о|ає|é|є consonnant=н|л|р|м|с|в|з|нн prefix={prefix_vc}{vowel}|{prefix_cv} prefix_vc=Лрн|Еон|Ад|Сар|Ал|Тал|Тін|Ел|Лег|Ор|Тір|Ол|Кáл|Кáн|Елв|Фан|Фад|Фіз|Філ|Гал|Глад|Лег|Глар|Глі|Хáр|Тад|Сóр|Пир prefix_cv=Ама|Амі|Бе|Ка|Га|Ісі|Ха|Хе|Ле|Лó|Ну|Ни|Ма|За|Зрі|Ті|Уну|Ве|Ва suffix=ор|ім|іан|ін|ар|ієль|ас|еон|ас|ор|іон|аль|анд|éр|ас|ір|єль|аль|ад|єаль centre={short_centre}|{short_centre}|-{short_centre}|{short_centre}- short_centre=лол|фебр|том|ліс|наль|лор|вóн|рад|рієн|мар|реб|рієль|мал|рам|ніль|нім|ноль|бріс|лад|рієр|ра|філь|зран|ман
